In [27]:
import pandas as pd # für Datenimport
import os # für Dateipfade

In [28]:
customers_file = "data/customers.csv"
customers_path = os.path.join(os.getcwd(), customers_file)
customers_data = pd.read_csv(customers_path)
offers_file = "data/offers.csv"
offers_path = os.path.join(os.getcwd(), offers_file)
offers_data = pd.read_csv(offers_path)
contacts_file = "data/contacts.csv"
contacts_path = os.path.join(os.getcwd(), contacts_file)
contacts_data = pd.read_csv(contacts_path)

In [35]:
customers_data.head()

  gender  age                           cust_id  became_member_on    income
0    NaN  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2    NaN  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4    NaN  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN

In [36]:
customers_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   gender            14825 non-null  object
 1   age               17000 non-null  int64
 2   cust_id           17000 non-null  object
 3   became_member_on  17000 non-null  int64
 4   income            14825 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 664.2+ KB

In [30]:
# customers_data = customers_data.drop(customers_data.columns[:2], axis=1)
customers_data.head()
print(customers_data.columns)

Index(['Unnamed: 0', 'Unnamed: 0.1', 'gender', 'age', 'cust_id',
       'became_member_on', 'income'],
      dtype='object')

In [31]:
# For-Schleife zum Vergleichen der Werte in den ersten beiden Spalten
for index, row in customers_data.iterrows():
    if row['Unnamed: 0'] - row['Unnamed: 0.1'] != 0:
        print(f"Fehler in Zeile {index+1}: Wert von Spalte B ist nicht gleich dem Wert von Spalte A")

In [32]:
customers_data = customers_data.drop(['Unnamed: 0', 'Unnamed: 0.1'], axis=1) # drop-Funktion gibt es ein neues DataFrame aus
customers_data.head()

  gender  age                           cust_id  became_member_on    income
0    NaN  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2    NaN  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4    NaN  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN